Revit 2026 API

# UVNormalize Method

---

Returns a new UV whose coordinates are the normalized values from this vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV Normalize()
```
```vb
Public Function Normalize As UV
```
```cpp
public:
UV^ Normalize()
```
```fsharp
member Normalize : unit -> UV
```

#### Return Value

UVThe normalized UV or zero if the vector is almost Zero.

Normalized indicates that the length of this vector equals one (a unit vector).

#### Reference

UV Class

Autodesk.Revit.DB Namespace